{
    "summary": "Cybergod is a project utilizing GPT4 MoE architecture, targeting specific audiences with entertainment and utility features. It involves devcontainers, AI training, multiple services/agents, mouse calibration, learning approach, pre-trained data via random keystrokes, and explores AI limitations, visual grids, prompt engineering, different environments (Chromium/Firefox), Docker for isolated execution, and JPEG streaming services for visualization.",
    "details": [
        {
            "comment": "The code is displaying the Cybergod logo and providing links to various resources such as a discord group, live streaming site, and related datasets. The intro section explains the concept of using random keystrokes for pre-trained data instead of human demonstrations, mentioning similar projects like OpenAI's Universe and SerpentAI.",
            "location": "\"/media/root/Toshiba XG3/works/cybergod_doc/src/README.md\":0-28",
            "content": "![Cybergod logo](propaganda/logos/cybergod_2.png)\nhttps://github.com/Significant-Gravitas/Auto-GPT/assets/103997068/8e1cd6fe-c49d-4d2b-835d-0ffc9a5a458e\n# Cybergod\n[join discord group](https://discord.gg/eM5vezJvEQ)\n[bilibili live streaming](http://live.bilibili.com/22228498)\n## Intro\nTrained on [The Frozen Forest](https://huggingface.co/datasets/James4Ever0/the_frozen_forest), a [dataset](https://modelscope.cn/datasets/james4ever0/the_frozen_forest/summary) containing random keystrokes, mouse clicks and screen recordings.\nthe openai [universe](https://github.com/openai/universe) is using VNC, almost doing the same thing.\nyou can find some demo models from [there](https://github.com/openai/universe-starter-agent).\ncheck out [SerpentAI](https://github.com/SerpentAI/SerpentAI)\nbut why bother? we can build these things in the same way.\nhuman demonstrations are limited, but random keystrokes are infinite.\ntry to obtain infinite data as pretrained data, then fine-tune on human demonstrations.\n---\n键鼠真神是一种"
        },
        {
            "comment": "Ideology and system requirements for cybergod automation.",
            "location": "\"/media/root/Toshiba XG3/works/cybergod_doc/src/README.md\":28-90",
            "content": "意识形态\ncybergod is an ideology.\n键鼠真神 又名cybergod 赛博真神\n训练数据集为the frozen forest 随机敲键盘点鼠标 录屏\n奖励函数 如果屏幕发生变化 奖励上一次行为\n避免把系统关机 被锁在屏幕外面\n避免机器卡死： 监测机器是否卡死 如果卡死那么自动外部重启 （重置状态，重新跑脚本）\n连着WEBDAV一起刷新 有filelock\n(直接取消lock权限)\n---\nlooking for using docker for automation, or using some tty-like things for automation.\ndisable ubuntu system authentication?\n---\nmake some server for vm to access to restart the webdav server when you have error.\n---\nagi_workspace happen to be in recycle bin. make sure we have the init files.\nmake sure we can restore our environments in every restart.\n---\nspice-protocol\nfound on utm.app, launch qemu and create spice unix socket.\nhttps://github.com/Shells-com/spice\nhttps://github.com/gnif/PureSpice\nhttps://github.com/citrix-openstack-build/spice-html5\nhttps://github.com/oetcxiaoliu/spice\nhttps://github.com/TotallWAR/spice_protocol\nremmina\n---\n掉盘问题： `cd .`\n(建议直接换个盘 或者换C口的数据线 A口不稳定 或者把硬盘取出来更新固件？)\nc口数据线观测中\n---\nto resolve the display resolution/mouse coordinate range matching issue, use pyautogui to get the resolutio"
        },
        {
            "comment": "The code is providing information about the project's features and objectives. It mentions GPT4 using MoE architecture, different connection ways, adapting to every situation, combining entertainment and utility, target audience, elo scoring, being a metagame that can play other games, and the use of a devcontainer for development environments.",
            "location": "\"/media/root/Toshiba XG3/works/cybergod_doc/src/README.md\":90-136",
            "content": "n then capture display using that resolution (resize to it)\n---\nGPT4 is using MoE as its architecture.\n---\nthe main objective of AGI is to create another version of itself.\n---\nways of connection:\nvnc, ssh, tty, tmux, hdmi capture & hid emulator, window capture and directed inputs (os specific)\n---\nthe point is not making this exhaustive. it is about making some standard i/o and adapt to every situation.\n---\n改变开发思路：将功能和娱乐相结合\n受众：游戏娱乐向 实用向\n发布程序到steam平台\n为此需要宣传、绘画设计等等\n---\n用elo进行打分 分高的可以在官网有较高的模型权重排名\n---\ntechnically this would not be a normal game. it is a metagame, which is the game of all games. it can play other games, play itself, even create itself.\n---\ndevcontainer is useful for creating reproducible environments locally (if of the same architecture, like x86) or remotely (different architecture, like Apple M1).\n---\nbecause setting this up properly during development is a pain in the ass (in most time), let's pack it up into a docker container, for your safety.\nif you want to release this and use it in prod"
        },
        {
            "comment": "This code appears to contain various notes and comments related to development, containerization, and AI training. The author seems to be working on a project involving containers, AI, and potentially multiple services or agents interacting with each other. Some issues like mouse calibration and the approach for learning are also mentioned.",
            "location": "\"/media/root/Toshiba XG3/works/cybergod_doc/src/README.md\":136-163",
            "content": "uction, you can refactor the code, configure platform specific dependencies and send it to devops.\n---\ndevcontainer won't work as expected on windows 11 as we put our repo on external disk\n---\nyour aim is too damn big! shall you begin to train some primitive neural network with functionality of only emitting and receiving ascii words, even just a single character like 'C'. get your hands dirty!\n---\nthe basic docker service is just like havoc. it does not contain anything 'intelligent'. only 'life support'.\nwe plan to containerize chatdev/open-interpreter/autogpt. after that, we will combine the two, and create some 'capitalism' among multiple containers.\nfinally we will create some ever-evolving agent and use that as the building block for the megasystem.\n---\nthe mouse calibration issue can be of major concern. we don't find it anywhere. \nuse active inference or reinforcement learning?\n---\nthanks to our pioneers that guided us some 'aimless' learning, i think it does not matter how we learn specifi"
        },
        {
            "comment": "This code discusses the limitations of current AI systems and their inability to adapt or optimize towards personal goals. It also expresses frustration with other organizations, such as OpenAI, believing that everyone has had similar ideas before and that they do not trust or fully utilize their AI systems.",
            "location": "\"/media/root/Toshiba XG3/works/cybergod_doc/src/README.md\":163-174",
            "content": "c things. when we learn things relevant to our personal goals, we are inevitably going to optimize the algorithm towards our desired values.\nif qstar is just about long term thinking, it could be useful since that is something currently missing in ai systems. when it comes to issues like calibration errors, fixing bugs, handling uncertainties, worse than human. they often get stuck into repetition, never seek for improvements and will not get bored in the loop, which is quite strange and unusual.\n---\ni think you are getting jealous over openai, since they are consisted of the world's smartest asses and come over new ideas every fucking day. but that does not matter. i think i had the idea before. i think everyone around the world had the same damn idea before. we do not need its mercy to teach us the dream we had via abstract symbols and formulas. we do our own. worst of all, they do not trust their ai systems, severely limited the ability of ai, left it overthinking and powerless.\n---\nthe "
        },
        {
            "comment": "The code seems to contain a mix of thoughts and questions related to various topics such as visual grids, calibration methods, prompt engineering, active inference, reward functions, and gaming. The author appears to be seeking insights into these areas and is open to suggestions for improvement or alternative approaches.",
            "location": "\"/media/root/Toshiba XG3/works/cybergod_doc/src/README.md\":174-192",
            "content": "`self-operating-computer` is using visual grid (just putting grid and text over screenshot, kinda like this hackish approach) for calibration. are you sure it is a good idea? do you need some extra channel over this to avoid information loss?\ndoes this work for games as well?\n---\nprompt engineering is a tweak around prior, in order to change posterior. they want to know better prior to get better posterior. kind like searching for the reason behind the decision, backtracking. so why not just use bidirectional or arbitrary directional language models instead of causal models?\n---\ni don't understand active inference. however there is a debate over whether to change the environment to fit prediction, or to change prediction to fit the environment. sounds like quantum entanglement.\n---\nthe reward function is part of the observation, usually not something life critical so it will not be so direct. it is the internal state that will be affected by the observation.\n---\nplay fps at: https://krunker.io/"
        },
        {
            "comment": "This code snippet describes how to run a program in different environments: within Chromium or Firefox, using Docker for isolated execution without interference, and utilizing JPEG streaming services for visualization by opening it in the browser. Additionally, it shows an image of star history from the \"james4ever0/agi_computer_control\" repository on the Star-History website.",
            "location": "\"/media/root/Toshiba XG3/works/cybergod_doc/src/README.md\":192-200",
            "content": " (in chromium, not firefox)\n---\nif want to run the program isolated, without interference, you use docker. if want to visualize, use jpeg streaming service and open in browser.\n## Star History\n<img src=\"https://api.star-history.com/svg?repos=james4ever0/agi_computer_control&Timeline\" style=\"filter: invert(100%);\"></img>"
        }
    ]
}